Revit 2027 API
GlobalParametersManager.IsValidGlobalParameter Method
 Tests whether an ElementId is of a global parameter in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidGlobalParameter(
	Document document,
	ElementId parameterId
)
Public Shared Function IsValidGlobalParameter (
	document As Document,
	parameterId As ElementId
) As Boolean
public:
static bool IsValidGlobalParameter(
	Document^ document,
	ElementId^ parameterId
)
static member IsValidGlobalParameter :
        document : Document *
        parameterId : ElementId -> bool
Parameters
document Document
 The document containing the global parameter.
parameterId ElementId
 Id of a global parameter
Return Value
Boolean
 Returns True if the Id is of a valid global parameter; False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
GlobalParametersManager Class
Autodesk.Revit.DB Namespace